<a href="https://colab.research.google.com/github/Pattiecodes/DC_DS-in-R/blob/main/Module_5_Introduction_to_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# --- Module Start ---

# Querying the books table
You're ready to practice writing your first SQL queries using the SELECT and FROM keywords. Recall from the video that SELECT is used to choose the fields that will be included in the result set, while FROM is used to pick the table in which the fields are listed.

Feel free to explore books in the exercise.

Your task in this exercise is to practice selecting fields from books.

Instructions 1/3
35 XP
Select the title from the books table to view all book titles.

In [ ]:
-- Return all titles from the books table
SELECT title
FROM books;

Instructions 2/3
Select both the title and author fields from books.

In [ ]:
-- Select title and author from the books table
SELECT title, author
FROM books;

Instructions 3/3 Select all fields from the books table.

In [ ]:
-- Select all fields from the books table
SELECT *
FROM books;

# Making queries DISTINCT
You've learned that the DISTINCT keyword can be used to return unique values in a field.

The books table contains 350 books, representing all of the books that our local library has available for checkout.

But how many different authors are represented in these 350 books?

Instructions 1/2
50 XP
Select only the unique authors from the books table.

In [ ]:
-- Select unique authors from the books table
SELECT DISTINCT author
FROM books;

Instructions 2/2 Update the code to return the unique author and genre combinations in the books table.

In [ ]:
-- Select unique authors and genre combinations from the books table
SELECT DISTINCT author, genre
FROM books;